Autodesk.Revit.DB.PointOnCurveMeasureFrom
Point on curve MeasureFrom - It tells from which end of the host curve the point location is measured.
Since:
2012
Since:
2012

Autodesk.Revit.DB.PointOnCurveMeasureFrom.End
End of the host curve.

Autodesk.Revit.DB.PointOnCurveMeasureFrom.Beginning
Beginning of the host curve.